# Pandas

In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame(data={
    'apples': [2, 4, 7], 
    'oranges': [3, 6, 9]
})
df

   apples  oranges
0       2        3
1       4        6
2       7        9

In [4]:
s1 = pd.Series([2, 4, 9])
s1

0    2
1    4
2    9
dtype: int64

In [5]:
s2 = pd.Series(['a', 'e', 'k'])
s2

0    a
1    e
2    k
dtype: object

In [9]:
s3 = pd.Series([1.2, 9.2, 3.3])
s3

0    1.2
1    9.2
2    3.3
dtype: float64

In [11]:
my_data = {
    'A': s1, 
    'B': s2, 
    'C': s3
}
df = pd.DataFrame(data=my_data)
df

   A  B    C
0  2  a  1.2
1  4  e  9.2
2  9  k  3.3

In [13]:
df = pd.DataFrame(data={
    'apples': [2, 4, 7], 
    'oranges': [3, 6, 9]
}, index=['David', 'James', 'Bond'])
df

       apples  oranges
David       2        3
James       4        6
Bond        7        9

In [14]:
df['apples']

David    2
James    4
Bond     7
Name: apples, dtype: int64

In [15]:
df.apples

David    2
James    4
Bond     7
Name: apples, dtype: int64

In [18]:
df.loc['James']

apples     4
oranges    6
Name: James, dtype: int64

In [19]:
df.loc['James'].apples

4

In [20]:
df.apples.loc['James']

4

In [21]:
df = pd.read_csv('../datasets/purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [22]:
df = pd.read_csv('../datasets/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [23]:
df.describe()

         apples  oranges
count  4.000000  4.00000
mean   1.500000  3.00000
std    1.290994  2.94392
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.250000  4.00000
max    3.000000  7.00000

In [24]:
df.describe().transpose()

         count  mean       std  min   25%  50%   75%  max
apples     4.0   1.5  1.290994  0.0  0.75  1.5  2.25  3.0
oranges    4.0   3.0  2.943920  0.0  1.50  2.5  4.00  7.0

In [26]:
df.head(2)

        apples  oranges
June         3        0
Robert       2        3